; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	thermograph2 - mode
	spectrograph4 - mode
	infrared3 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Star6 infrared1)
	(have_image Planet7 spectrograph4)
	(have_image Planet8 infrared3)
	(have_image Planet9 spectrograph4)
	(have_image Planet10 thermograph2)
	(have_image Star11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Star13 infrared3)
	(have_image Planet14 infrared3)
	(have_image Star15 infrared3)
	(have_image Planet16 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   goals met: 0 of 11
5. (take_image satellite0 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 1 of 11
6. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 1 of 11
7. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 2 of 11
8. (turn_to satellite0 planet7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet7)
   goals met: 2 of 11
9. (take_image satellite0 planet7 instrument1 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 3 of 11
10. (turn_to satellite0 groundstation2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 11
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 11
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
13. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 3 of 11
14. (turn_to satellite0 planet10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet10)
   goals met: 3 of 11
15. (take_image satellite0 planet10 instrument0 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 4 of 11
16. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 4 of 11
17. (take_image satellite0 planet12 instrument0 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 5 of 11
18. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 5 of 11
19. (take_image satellite0 planet14 instrument0 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 6 of 11
20. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 6 of 11
21. (take_image satellite0 planet16 instrument0 infrared3)
   added: (have_image planet16 infrared3)
   goals met: 7 of 11
22. (turn_to satellite0 planet8 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet8)
   goals met: 7 of 11
23. (take_image satellite0 planet8 instrument0 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 8 of 11
24. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 8 of 11
25. (take_image satellite0 star11 instrument0 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 9 of 11
26. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 9 of 11
27. (take_image satellite0 star13 instrument0 infrared3)
   added: (have_image star13 infrared3)
   goals met: 10 of 11
28. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 10 of 11
29. (take_image satellite0 star15 instrument0 infrared3)
   added: (have_image star15 infrared3)
   goals met: 11 of 11
